In [1]:
# import library
import pandas as pd

In [2]:
# read the CSV
df = pd.read_csv("../Week3_Onwards/unifed_csv_without_duplicated_company.csv")

In [3]:
# df.head()

In [4]:
# specify the column to count
col_to_count = 'employee_count'
series = df[col_to_count].value_counts()

In [5]:
series

1-10          17014
11-50         10452
unknown        5882
51-100         1490
101-250        1419
251-500         484
501-1000        195
1001-5000       171
10000+           47
5001-10000       44
Name: employee_count, dtype: int64

In [6]:
# drop the undesired labels
labels_to_drop = ['unknown']
series.drop(labels=labels_to_drop, inplace=True)

In [7]:
series

1-10          17014
11-50         10452
51-100         1490
101-250        1419
251-500         484
501-1000        195
1001-5000       171
10000+           47
5001-10000       44
Name: employee_count, dtype: int64

In [8]:
temp = series['10000+']
series.drop(labels='10000+', inplace=True)
series['10000+'] = temp

In [9]:
series

1-10          17014
11-50         10452
51-100         1490
101-250        1419
251-500         484
501-1000        195
1001-5000       171
5001-10000       44
10000+           47
Name: employee_count, dtype: int64

In [10]:
df = series.to_frame()

In [11]:
df

            employee_count
1-10                 17014
11-50                10452
51-100                1490
101-250               1419
251-500                484
501-1000               195
1001-5000              171
5001-10000              44
10000+                  47

In [12]:
df.reset_index(inplace=True)

In [13]:
df

        index  employee_count
0        1-10           17014
1       11-50           10452
2      51-100            1490
3     101-250            1419
4     251-500             484
5    501-1000             195
6   1001-5000             171
7  5001-10000              44
8      10000+              47

In [14]:
# rename in the dict
df.rename(columns={'employee_count': 'freq', 'index': 'employee_count'}, inplace=True)

In [15]:
df

  employee_count   freq
0           1-10  17014
1          11-50  10452
2         51-100   1490
3        101-250   1419
4        251-500    484
5       501-1000    195
6      1001-5000    171
7     5001-10000     44
8         10000+     47

In [16]:
# output df or series
# uncomment to output a lightweight csv
# df.to_csv("employee_count.csv", index=False)
df.to_string(index=False)

'employee_count   freq\n          1-10  17014\n         11-50  10452\n        51-100   1490\n       101-250   1419\n       251-500    484\n      501-1000    195\n     1001-5000    171\n    5001-10000     44\n        10000+     47'

## No. of Funding Rounds

In [1]:
import pandas as pd
df = pd.read_csv("../Week3_Onwards/unifed_csv_without_duplicated_company.csv")

In [2]:
series = df['num_funding_rounds'].value_counts().sort_index()
series

0.0        4
1.0     6396
2.0     2518
3.0     1304
4.0      780
5.0      429
6.0      246
7.0      151
8.0       94
9.0       46
10.0      22
11.0      18
12.0       7
13.0       5
14.0       7
15.0       3
16.0       2
17.0       1
19.0       1
20.0       1
23.0       1
Name: num_funding_rounds, dtype: int64

In [3]:
df = series.to_frame()
df = series.reset_index().drop(index=0) # Remove no. of rounds == 0
df

    index  num_funding_rounds
1     1.0                6396
2     2.0                2518
3     3.0                1304
4     4.0                 780
5     5.0                 429
6     6.0                 246
7     7.0                 151
8     8.0                  94
9     9.0                  46
10   10.0                  22
11   11.0                  18
12   12.0                   7
13   13.0                   5
14   14.0                   7
15   15.0                   3
16   16.0                   2
17   17.0                   1
18   19.0                   1
19   20.0                   1
20   23.0                   1

In [4]:
df['index'] = df['index'].astype(int)
df

    index  num_funding_rounds
1       1                6396
2       2                2518
3       3                1304
4       4                 780
5       5                 429
6       6                 246
7       7                 151
8       8                  94
9       9                  46
10     10                  22
11     11                  18
12     12                   7
13     13                   5
14     14                   7
15     15                   3
16     16                   2
17     17                   1
18     19                   1
19     20                   1
20     23                   1

In [6]:
df.rename(columns={'index': 'x_labels', 'num_funding_rounds': 'y_values'}, inplace=True)
df

    x_labels  y_values
1          1      6396
2          2      2518
3          3      1304
4          4       780
5          5       429
6          6       246
7          7       151
8          8        94
9          9        46
10        10        22
11        11        18
12        12         7
13        13         5
14        14         7
15        15         3
16        16         2
17        17         1
18        19         1
19        20         1
20        23         1

In [7]:
df.to_csv(index=False)

'x_labels,y_values\r\n1,6396\r\n2,2518\r\n3,1304\r\n4,780\r\n5,429\r\n6,246\r\n7,151\r\n8,94\r\n9,46\r\n10,22\r\n11,18\r\n12,7\r\n13,5\r\n14,7\r\n15,3\r\n16,2\r\n17,1\r\n19,1\r\n20,1\r\n23,1\r\n'